Repository: logto-io/wordpress
Catalog: src/languages/logto-*.po
Languages: de_de, es_es

source: Logto - User Authentication and Authorization
de_de: Logto - Benutzer-Authentifizierung und -Autorisierung
es_es: Logto - Autenticación y autorización de usuarios

source: Enable beautiful and secure user authentication, including passwordless, social login, single sign-on (SSO), multi-factor authentication (MFA). Generic OAuth2, OpenID Connect, SAML are also supported. Use role-based access control (RBAC) to manage user permissions.
de_de: Ermöglichen Sie eine schöne und sichere Benutzer-Authentifizierung, einschließlich passwortlosem Login, sozialem Login, Single Sign-On (SSO), Multi-Faktor-Authentifizierung (MFA). Generisches OAuth2, OpenID Connect und SAML werden ebenfalls unterstützt. Verwenden Sie rollenbasierte Zugriffskontrolle (RBAC), um Benutzerberechtigungen zu verwalten.
es_es: Habilita una autenticación de usuario segura y atractiva, incluyendo acceso sin contraseña, inicio de sesión social, inicio de sesión único (SSO) y autenticación multifactor (MFA). También se admiten OAuth2 genérico, OpenID Connect y SAML. Usa el control de acceso basado en roles (RBAC) para gestionar los permisos de los usuarios.

source: Logto endpoint
de_de: Logto-Endpunkt
es_es: Punto de conexión de Logto

source: App ID
es_es: ID de la aplicación

source: App secret
de_de: App-Geheimnis
es_es: Secreto de la aplicación

source: Redirect URI
es_es: URI de redirección

source: Post sign-out redirect URI
es_es: URI de redirección después de cerrar sesión

source: Scope
de_de: Bereich
es_es: Ámbito

source: Extra params
de_de: Zusätzliche Parameter
es_es: Parámetros adicionales

source: Require verified email
de_de: Verifizierte E-Mail erforderlich
es_es: Requerir correo electrónico verificado

source: Require organization ID
de_de: Organisations-ID erforderlich
es_es: Requerir ID de organización

source: Role mapping
de_de: Rollen-Zuordnung
es_es: Asignación de roles

source: Remember session
de_de: Sitzung merken
es_es: Recordar sesión

source: Sync profile
de_de: Profil synchronisieren
es_es: Sincronizar perfil

source: WordPress form login
de_de: WordPress-Formular-Login
es_es: Inicio de sesión con formulario de WordPress

source: Username strategy
de_de: Benutzername-Strategie
es_es: Estrategia de nombre de usuario

# Error title
source: Failed to login
es_es: Error al iniciar sesión

# Error title when error is unknown
source: Unknown error
es_es: Error desconocido

# Default error description for login failure
source: Please try again later or contact the site administrator.
es_es: Por favor, inténtalo de nuevo más tarde o contacta al administrador del sitio.

# Error title
source: Failed to login: %s
es_es: Error al iniciar sesión: %s

# Error title
source: Email not found
es_es: Correo electrónico no encontrado

# Error content for email not found
source: Email is required to complete login. Please contact the site administrator.
es_es: Se requiere correo electrónico para completar el inicio de sesión. Por favor, contacta al administrador del sitio.

# Error title
source: Email not verified
es_es: Correo electrónico no verificado

# Error content for email not verified
source: Email should be verified to complete login. Please contact the site administrator.
es_es: El correo electrónico debe estar verificado para completar el inicio de sesión. Por favor, contacta al administrador del sitio.

# Error title
source: Unauthorized
es_es: No autorizado

# Error title
source: Failed to create user
es_es: Error al crear el usuario

source: Logto Settings
de_de: Logto-Einstellungen
es_es: Configuración de Logto

source: Settings
de_de: Einstellungen
es_es: Configuración

source: Logto Help
de_de: Logto Hilfe
es_es: Ayuda de Logto

source: Help
de_de: Hilfe
es_es: Ayuda

source: Basic settings
de_de: Grundeinstellungen
es_es: Configuración básica

# Basic settings description
source: Settings required to connect to Logto. You can find these settings in the Logto Console application details page.
de_de: Einstellungen, die erforderlich sind, um eine Verbindung zu Logto herzustellen. Sie können diese Einstellungen auf der Anwendungsdetailseite der Logto Console finden.
es_es: Configuración necesaria para conectarse a Logto. Puedes encontrar estos ajustes en la página de detalles de la aplicación en Logto Console.

# Logto endpoint description
source: The endpoint of your Logto instance. If you are using a custom domain, enter the custom domain here.
de_de: Der Endpunkt Ihrer Logto-Instanz. Wenn Sie eine benutzerdefinierte Domain verwenden, geben Sie hier die benutzerdefinierte Domain ein.
es_es: El punto de conexión de tu instancia de Logto. Si estás usando un dominio personalizado, ingrésalo aquí.

# App ID description
source: The app ID that shows up in the Logto Console application details page.
de_de: Die App-ID, die auf der Anwendungsdetailseite der Logto Console angezeigt wird.
es_es: El ID de la aplicación que aparece en la página de detalles de la aplicación en Logto Console.

# App secret description
source: One of the app secrets that shows up in the Logto Console application details page.
de_de: Ein App-Geheimnis, das auf der Anwendungsdetailseite der Logto Console angezeigt wird.
es_es: Uno de los secretos de la aplicación que aparece en la página de detalles de la aplicación en Logto Console.

# Redirect URI description
source: The redirect URI you need to enter and save in the Logto Console application details page.
es_es: La URI de redirección que necesitas ingresar y guardar en la página de detalles de la aplicación en Logto Console.

# Post sign-out redirect URI description
source: The post sign-out redirect URI you need to enter and save in the Logto Console application details page.
es_es: La URI de redirección después de cerrar sesión que necesitas ingresar y guardar en la página de detalles de la aplicación en Logto Console.

# Authentication settings description
source: Settings related to user authentication. These settings may affect the user experience.
de_de: Einstellungen zur Benutzer-Authentifizierung. Diese Einstellungen können die Benutzererfahrung beeinflussen.
es_es: Configuración relacionada con la autenticación de usuarios. Estos ajustes pueden afectar la experiencia del usuario.

# Scope description
source: The scopes to use for the authentication request. Separate multiple scopes by spaces.
de_de: Die Bereiche, die für die Authentifizierungsanforderung verwendet werden sollen. Trennen Sie mehrere Bereiche durch Leerzeichen.
es_es: Los ámbitos a utilizar en la solicitud de autenticación. Separa múltiples ámbitos con espacios.

# Extra params description
source: Extra authentication parameters to include in the authentication request. Use the URL query string format, e.g., <code>param1=value1&amp;param2=value2</code>.
de_de: Zusätzliche Authentifizierungsparameter, die in der Authentifizierungsanforderung enthalten sein sollen. Verwenden Sie das URL-Abfragezeichenfolgenformat, z. B. <code>param1=value1&amp;param2=value2</code>.
es_es: Parámetros de autenticación adicionales para incluir en la solicitud de autenticación. Usa el formato de cadena de consulta de URL, por ejemplo, <code>param1=value1&amp;param2=value2</code>.

# Require verified email description
source: Require user email to be verified before logging in
de_de: Benutzer-E-Mail muss vor dem Anmelden verifiziert werden
es_es: Requerir que el correo electrónico del usuario esté verificado antes de iniciar sesión

# Require verified email explanation
source: Whether to require user email to be verified at Logto. If enabled, users with unverified emails will not be able to log in.
de_de: Ob die Benutzer-E-Mail bei Logto verifiziert werden muss. Wenn aktiviert, können Benutzer mit nicht verifizierten E-Mails sich nicht anmelden.
es_es: Si se debe requerir que el correo electrónico del usuario esté verificado en Logto. Si está activado, los usuarios con correos electrónicos no verificados no podrán iniciar sesión.

# Require organization ID description
source: When set, users must belong to the specified organization to log in.
de_de: Wenn eingestellt, müssen Benutzer zur angegebenen Organisation gehören, um sich anzumelden.
es_es: Cuando está configurado, los usuarios deben pertenecer a la organización especificada para iniciar sesión.

source: Authorization settings
de_de: Autorisierungseinstellungen
es_es: Configuración de autorización

# Authorization settings description
source: Settings related to user authorization. These settings may affect the user experience and access control.
de_de: Einstellungen zur Benutzerautorisierung. Diese Einstellungen können die Benutzererfahrung und die Zugriffskontrolle beeinflussen.
es_es: Configuración relacionada con la autorización de usuarios. Estos ajustes pueden afectar la experiencia del usuario y el control de acceso.

# Role mapping description
source: Map Logto roles to WordPress roles with order of precedence (case-sensitive).<br/>When a role is found in the mapping, the user will be assigned the corresponding WordPress role and the rest of the mapping will be ignored.
es_es: Mapea roles de Logto a roles de WordPress con un orden de precedencia (sensible a mayúsculas y minúsculas).<br/>Cuando se encuentra un rol en la asignación, se asignará al usuario el rol correspondiente en WordPress y se ignorará el resto de la asignación.

source: Logto role
de_de: Logto-Rolle
es_es: Rol de Logto

source: WordPress role
de_de: WordPress-Rolle
es_es: Rol de WordPress

source: Advanced settings
de_de: Erweiterte Einstellungen
es_es: Configuración avanzada

# Remember session description
source: Remember user session for a longer period
de_de: Benutzersitzung für einen längeren Zeitraum merken
es_es: Recordar la sesión del usuario por un período más largo

# Remember session explanation
source: By default, WordPress session expires after 2 days. Enable this setting to remember user session for a longer period (14 days).
de_de: Standardmäßig läuft die WordPress-Sitzung nach 2 Tagen ab. Aktivieren Sie diese Einstellung, um die Benutzersitzung für einen längeren Zeitraum (14 Tage) zu merken.
es_es: Por defecto, la sesión de WordPress expira después de 2 días. Activa esta configuración para recordar la sesión del usuario por un período más largo (14 días).

# Sync profile description
source: Sync user profile at every login
de_de: Benutzerprofil bei jeder Anmeldung synchronisieren
es_es: Sincronizar el perfil del usuario en cada inicio de sesión

# Sync profile explanation
source: When enabled, user profile will be synced from Logto at every login and existing WordPress profile will be overwritten (including role mapping).
es_es: Cuando está activado, el perfil del usuario se sincronizará desde Logto en cada inicio de sesión y el perfil existente en WordPress será sobrescrito (incluida la asignación de roles).

# WordPress form login description
source: Choose how to handle WordPress form login. You can disable WordPress form login to secure your site with Logto, or allow users to log in with WordPress form by appending a query parameter to the login URL.
de_de: Wählen Sie aus, wie das WordPress-Formular-Login behandelt werden soll. Sie können das WordPress-Formular-Login deaktivieren, um Ihre Seite mit Logto abzusichern, oder den Benutzern erlauben, sich über das WordPress-Formular anzumelden, indem Sie einen Abfrageparameter an die Login-URL anhängen.
es_es: Elige cómo manejar el inicio de sesión con el formulario de WordPress. Puedes deshabilitar el inicio de sesión con el formulario de WordPress para asegurar tu sitio con Logto, o permitir a los usuarios iniciar sesión con el formulario de WordPress agregando un parámetro de consulta a la URL de inicio de sesión.

source: Disabled
de_de: Deaktiviert
es_es: Deshabilitado

# WordPress form login query option
source: Query (append <code>?form=1</code> to use WordPress form login)
de_de: Abfrage (fügen Sie <code>?form=1</code> hinzu, um das WordPress-Formular-Login zu verwenden)
es_es: Consulta (agrega <code>?form=1</code> para usar el formulario de inicio de sesión de WordPress)

# Username strategy description
source: Choose how to determine the WordPress username when a user logs in with Logto.
de_de: Wählen Sie aus, wie der WordPress-Benutzernamen bestimmt werden soll, wenn sich ein Benutzer mit Logto anmeldet.
es_es: Elige cómo determinar el nombre de usuario de WordPress cuando un usuario inicia sesión con Logto.

# Smart username strategy
source: <b>Smart:</b> Use Logto email if available, otherwise use Logto username
de_de: <b>Smart:</b> Verwenden Sie die Logto-E-Mail, wenn verfügbar, andernfalls verwenden Sie den Logto-Benutzernamen
es_es: <b>Inteligente:</b> Usar el correo electrónico de Logto si está disponible, de lo contrario, usar el nombre de usuario de Logto

# Email username strategy
source: <b>Email:</b> Use Logto email
de_de: <b>Email:</b> Verwenden Sie die Logto-E-Mail
es_es: <b>Correo electrónico:</b> Usar el correo electrónico de Logto

# Username username strategy
source: <b>Username:</b> Use Logto username
de_de: <b>Benutzername:</b> Verwenden Sie den Logto-Benutzernamen
es_es: <b>Nombre de usuario:</b> Usar el nombre de usuario de Logto

source: Field "%s" is required.
de_de: Feld "%s" ist erforderlich.
es_es: El campo "%s" es obligatorio.

source: Settings updated.
de_de: Einstellungen aktualisiert.
es_es: Configuración actualizada.

source: Add
de_de: Hinzufügen
es_es: Añadir

source: Remove
de_de: Entfernen
es_es: Eliminar

# Role mapping description
source: Map Logto roles to WordPress roles with order of precedence.<br/>When a role is found in the mapping, the user will be assigned the corresponding WordPress role and the rest of the mapping will be ignored.
de_de: Mappe Logto-Rollen auf WordPress-Rollen mit Vorrangordnung.<br/>Wenn eine Rolle in der Zuordnung gefunden wird, wird dem Benutzer die entsprechende WordPress-Rolle zugewiesen und der Rest der Zuordnung wird ignoriert.

# Sync profile explanation
source: When enabled, user profile will be synced from Logto at every login and existing WordPress profile will be overwritten.
de_de: Wenn aktiviert, wird das Benutzerprofil bei jeder Anmeldung von Logto synchronisiert und das bestehende WordPress-Profil wird überschrieben.
